#coding=utf-8

import matplotlib.pyplot as plt
import jieba
from wordcloud import WordCloud, STOPWORDS, ImageColorGenerator
import collections

def GetWordCloud(name):
    path_text = "C:/Users/DELL/Desktop/电影放映厅/源文本/" + name + '.txt'
    f = open(path_text, 'r', encoding='utf-8').read()
    cut_text = jieba.cut(f, cut_all=False)

    # 自定义滤词库
    remove_words = [u'的', u'这部', u'片子', u'宾利', u'吧', u'就是', u'不过', u'上', u'有点', u'，', u'和', u'是', u'随着', u'对于',u'对', u'等', u'能', u'又', u'···', u'..', u'这么', u'.', u'剧', u'一部', u'电视剧', u'着', u'~', u'看到', u'没有',u'都', u'。', u' ', u'、', u'中', u'在', u'了', u'通常', u'如果', u'结尾', u'但是', u'第二季', u'第一季', u'我们', u'需要', u'“', u'”', u'\n', u'到', u'!', u'我', u'也', u'，', u'剧情', u'第三季', u'比', u'看', u'集', u'看', u'就', u'系列', u'最后', u'这', u'…', u'电影', u'?', u'还', u'一集', u'被', u'说', u'编剧', u'给', u'两季', u'还是', u'一个', u'！', u'有', u'人', u'但', u'没', u'终于', u'？', u'一季', u'不是', u'真的', u'你', u'虽然', u'但是', u'什么', u'要', u'吗', u'普通话', u'吗', u'自己', u'黑', u'拍', u'挺', u'季', u'前', u'，', u',', 'the', u'觉得', u'它', u'他', 'for' , 'film' , 'people' , u'“', u'by', u'开头', u'So', u'DV', u'with', u'中间', u'相当', u'或', u'all', u'不会', u'会', u'从', u'最', u'这样', u'片', u'感觉', u'这种', u'棒子', u'题材', u'好', u'完', u'设定', u'不错', u'多么', u'哈哈', u'Day', u'快', u'不到', u'猜', u'that', u'感到', u'look', u'身上', u'依旧', u'不再', u'一场','17', 'Nicole', u'后面', u'够', u'已经', u'那个', u'看过', u'第一部', u'=', u'除了', u'第二部', u'女', u'成', u'第三部', u'个', u'实在', u'那么',u')', u'(', u'）', u'（', u'only', u'around', u'been', u'一贯', u's', u'at', u'and', u'If', u'all', u'仍然', u'~', u'啊', u'很', u'把', u'让', u'可以', u'/', u'不', u'·', u'《', u'太', u'大', u':', u'（', u'is', u'多', '#', u'竟然', u'一', u'确实', u'---', u'>', u'b', u'区域', u'留下', u'总', u'跑', u'妈', '5.8', u'cult', u'SM', u'SB', u'&', u'@', u'完全', u'分', u'；', u'最终', u'而且', u'整体', u'全程', u'水准', u'算是', u'结果', u'简直', u'以为', u'一种', u'用', u'该', u'根本', u'那段', '30', u'绝不', u'如果说', u'东西', u'的确', u'想来', '18', u'正值', u'内', u'有关', u'某些', '14', u'有些', u'算是', u'想', u'乍', u'一样', u'好歹', u'之作', u'现在', u'一惊', u'来', u'有些', u'毫无', u'居然', u'几乎', u'整个', u'本', u'开始', u'now', u'晚', u'之时', u'貌似', u'一折', u'屎', u'播', u'临时', u'上课', u'短暂', u'几率', u'折射出', u'出来', u'几部', u'不少', u'过', u'怎么', u'突然', u'更是', u'看着', u'那种', u'尾', u'五部', u'基', u'为', u'却', u'收官',
u'果然', u'有些', u'更让人', u"zooey", u'压根', u'回想', u'过程', u'真', u'"', u'固定', u'it', u'营造', u'way', u'莫名', u'依然', u'频繁', u'不要', u'效果', u'甚至', u'尤其', u'还有', u'三部', u'直接', u'你们', u'已', u'像', u'足足', u'打打', u'部分', u'永远', u'再', u'上次', u'怕', u'最让人', u'一句', u'到底', u'过头', u'能够', u'已风为', u'creepy', u'真不知道', u'以及', u'很多', u'下', u'预期', u'起', u'作为', u'不能', u'特别', u'100', u'其他', u'这次', u'来看', u'真', u'一口气', u'一次', u'唯一', u'每部', u'预告片', u'理解', u'较', u'最初', u'有种', u'Milla', u'衬托', u'没玩过', u'其他人', u'cool', u'画面', u'21', u'80', u'小', u'算', u'当然', u'之前', u'过去', u'来说', u'其他', u'后', u'第一集', u'一下', u'切换', u'拍个', u'毕竟', u'只有', u'少', u'相对', u'最想', u'拉远', u'不如说', u'回旋', u'猪脚', u'改变', u'刚刚开始', u'逐渐', u'我要', u'里面', u'赶紧', u'嘛', u'之', u'太多', u'掉', u'时', u'粉', u'大部分', u'完后', u'多年', u'非常', u'B', u'干脆', u'摔', u'回到', u'前面', u'I', u'think', '2002', u'世界', u'穿', u'不管怎么', u'留有', u'同类题材', u'原作', u'哪里', u'之后', u'只是', u'从头', u'明显', u'知道', u'无', u'级片', u'这里', u'冲', u'应该', u'本片', u'想起', u'结束', u'大概', u'成为', u'总之', u'的', u'地', u'一身', u'milla', u'超越', u'远不如', u'住', u'看惯', u'强', u'时候', u'反映', u'通通', '6', u'或许', u'全片', u'最好', u'星', u'不用', u'部', u'如', u'高', u'演', u'篇', u'感', u'艾', u'地上', u'反而', u'年', u'第一', u'所有', u'man', u'has', u'world', u'告诉', u'基本', u'遇到', u'后半段', '15', u'周', u'天', u'whole', u'冲着', u'当年', u'不管', u'out', u'一把', u'出现', u'eye', u'沦为', u'增加', u'不得不', u'必定', u'无数次', u'逃出', u'继续', u'一天', u'小时', u'第一', u'以', u'挂', u'逼', u'其实', u'的话', u'一系列', u'真正', u'写', u'向', u'一律', u'分钟', u'片尾', u'本来', u'跟', u'追', u'找到', u'走', u'一会', u'这是', u'要种', u'人家', u'不戴', u'引进', u'一颗', u'就算', u'某', u'讲', u'极度', u'主', u'一段', u'老', u'即使', u'这些', u'者', u'连', u'哪怕', u'啦', u'事', u'各', u'就要', u'买票', u'预算', u'接受', u'超级', u'二部', u'是因为', u'她', u'他', u'次', u'两部', u'此', u'戏', u'所以', u'原来', u'全是', u'发现', u'变成', u'度', u'衔接', u'任何', u'爱', u'怪', u'第二集', u'一包', u'更大', u'DTS', u'还要', u'加入', u'下去', u'吸引', u'所以', u'不如', u' 去', u'为了', u'+', u'呢', u'还会', u'另外', u'要是', u'那', u'去', u'么', u'各种', u'真是', u'哒', u'李冰冰', u'存在', u'啥', u'在于', u'到位', u'令人', u'缺点','23', '90', u'越', u'十几个', u'一群', u'T', u'干', u'以外', u'...', u'更', u'两个', u'：', u'才', u'时候', u'比较', u'结局', u'Will', u'里', u'当', u'因为', u'一直', u'相比', u'一点', u'-', u'另', u'于', u'you', u'The', u'准备', u'研究', u'no', u'Fehr', u'FANS', u'变', u'威', u'说好', u'对决', u'属于', u'之子', u'只为', u'而已', '10', '11', '25', '2009', u'之类', u'一则', u'不够', u'其中', u'那些', u'不是', u'他们', u'她们', u'12', u'一坨', u'种', u'越是', '3.5', u'不想', u'拖走', u'等待', u'于', u'算不上', u'倒', u'做', u'然后', u'倾向', u'下来', u'像是', u'没弄', u'关于', u'人怕', '13', u'咋', u'加', u'ua', u'反', '16''24', 'of', u'》', u'片中', u'进', u'前半段', u'there', u'are', u'not', u'can', u'will', u'呀', u'taking', u'变得', u'处理', u'符合', u'大家', u'不会', u'You', u'不论', u'this', u'版', u'没什么', u'm', u'显然', u'正是', u'第二遍', u'瞬间',
 '02', '2020', '20', u'再也', u'起来', u'……', u'具有', u'打开', u'时期', u'好多', u'日', u'重新', u'迎来', u'坡', u'月', u'最近', u'退', u'或者', u'每个', u'好久', u'to', u'必须', u'第一人称', u'一边', u'同样', u'爷', u'胜', u'以后', u'copy', u'方面', u'有人', '29', u'原因', u'心里', u'绝对', u'似乎', u'后来', u'放到', u'只', u'叫', u'马上', u'害', u'之间', u'式', u'这片', u'并', u'别的', u'面前', u'不算', u'搞', u'体现', u'一些', u'a', u'所能', u'总体', u'看起来', u'拍得', u'尼玛', u'点', u'如此', u'一定', u'且', u'一堆', '2012', u'众多', u'本身', u'不知', u'适合', u'尽力', u'星星', u'只能', u'将', u'面对', u'可是', u'通过', u'非', u'不了', u'们', u'哦', u'so', '40', u'半', u'讲得', u'估计', u'very', u'十分', u'下集', u'该片', u'无法', u'过于', u'可能', u'使', u'便是', u'也是', u'也许', u'谁', u'总是', u'一丝', u'注定', u'所', '96', u'发生', u'吉', u'一切', u'其', u'而是', u'蛮', u'记得', u'许多', u'多次', u'一辆', u'类型', u'如何', u'评价', u'★', u'□', u'更加', u'多少', u'想到', u'刚', u'出', u'几个', u'一起', u'一遍', u'好像', u'如今', u'二十', u'看得', u'找', u'之一', u'有个', u'谁家', u'哎', u'此片', u'当时', u'第一次', u'不可', u'表现', u'was', u'比如', u'~', u'既', u'人们', u'没法', u'更好', u'【', u'】', u'high', u'肯定', u'终极', u'弱智', u'喂', '123', u'难道', u'至少', u'白', '55', u'3d', '45', u'至于', u'那样', u'CG', u'坨', u'导致', u'D版', u'第四部', u'第五部', u'打了个', u'王', u'长得', u'睡着', u'别', u'弱', u'还原', u'越来越', u'打到', u'来演', u'乱', u'拍下去', u'剩下', u'才能', u'傻', u'彻底', u'换成', u'WWW', u'化', u'略', u'别人', u'n', u'偶尔', u'bilibili', u'不断', u'内心', u'约', u'木有', u'https', u'正', u'干嘛', '28','WWW','com', u'咱能', u'根据', u'主要', u'以前', u'Nicole', u'nicole', u'归于', '16', u'脑', u'拉', u'展现', u'请', u'足', u'只要', u'对比', u'一枪', u'水平', u'比起', u'旁边', u'﹁', u'﹂', u'靠', 'Z', u'进入', u'全场', u'问题', u'或是', u'第一个', u'第二个', 'Part', 'but', u"很久以前", u'按', u'依靠', '32', u'完胜', u'随便', u"第一个", u"第二个", u'播放', u"仍", u'一出', u'你好', "part", u'三个', u'第一', u'第二', u'年前', '22', '20130220', u'毒', '34', u'因此', u'穿着', u'虚', u'就毁', u'至今', u'结果', u'第三个', u'一年', u'附中', u"第一第二", u'那时', u'不知不觉', u'今天', "office", u'就毁', u'煞笔', u'改成', "19", u'初二', u'两段', u'分是', u'期间', u'不起', u'带', u'看见', "27", u'周围', u'浩然', u'主演', "14", "24", "26", u'阿', u'》', '1', '2', '3', '4', '5', '6', '7', '8', '9', '0', u'—', u'）', u'而', u'与', u'得', u'可', u'这个'
]

    scn_text = []
    for word in cut_text:
        if word not in remove_words:
            scn_text.append(word)

    word_counts = collections.Counter(scn_text)
    word_counts_top = word_counts.most_common(30)
    print(word_counts_top)
    # print(type(word_counts_top))

    # f_name = "C:/Users/DELL/Desktop/电影放映厅/词频统计/" + name + ".txt"
    # fd = open(f_name, 'w', encoding='utf-8')
    # cnt = 1
    # for i in word_counts_top:
    #     fd.write(str(cnt) + ' : ' + str(i) + '\n')
    #     cnt += 1
    # fd.close()

    wordcloud = WordCloud(
        font_path='C:/Windows/Fonts/HGY4_CNKI.TTF',
        background_color="white",height=880,width=1000).generate_from_frequencies(word_counts)

    # plt.subplot(1, 2, 1)
    plt.imshow(wordcloud, interpolation="bilinear")
    plt.axis("off")
    #
    # plt.subplot(1, 2, 2)
    # plt.clf()
    # plt.title("")
    # x = []
    # y = []
    # for one in word_counts_top:
    #     x.append(one[0])
    #     y.append(one[1])
    # plt.bar(x, y)
    # plt.xlabel("词汇")
    # plt.ylabel("次数")
    # plt.xticks(rotation=80)

    # plt.show()
    fn= "C:/Users/DELL/Desktop/电影放映厅/词云/" + name + ".png"
    print("正生成 : " + fn)
    plt.savefig(fn)

# 设置中文字体
plt.rcParams['font.family'] = ['SimHei']

df_li = [[10432911, '流感（2013）'], [4301043, '传染病（2011）'], [2983135, '感染列岛（2009）'], [1301419, '极度恐慌（1995）'], [2225784, '末日病毒（2009）'], [2028634, '盲流感（2008）'], [2133368, '天外来菌（2008）'], [2028640, '末日侵袭（2008）'], [19961361, '末日孤舰（2014-2016）'], [25969151, '末日孤舰（2014-2017）'], [26597902, '末日孤舰（2014-2018）'], [2153515, '一级恐惧（1999）'], [1306421, '惊变28天（2002）'], [1298917, '卡桑德拉大桥（1976）'], [11627068, '大明劫（2013）'], [1298744, '十二猴子（1996）'], [1306513, '终极细胞战（2013）'], [2255841, '死亡录像（2007）'], [26320765, '伊波拉病毒（1996）'], [1498578, '非典人生（2003）'], [2084427, '流行病毒（2007）'], [21348112, '神秘感染（2013）'], [2073674, '灭顶之灾（2008）'], [25986180, '釜山行（2016）'], [6839145, '铁线虫入侵（2013）'], [1482051, '致命拜访（2007）'], [1820156, '我是传奇（2007）'], [1306809, '生化危机1'], [1308752, '生化危机2'], [1482911, '生化危机3'], [3041294, '生化危机4'], [6532822, '生化危机5'], [20471852, '生化危机6']]

def work():
    for i in df_li:
        GetWordCloud(i[1])

work()
